# dict = {"k1":"v1","k2":"v2","k3":"v3"}
#1、请循环遍历出所有的key
# for a,b in dict.items():
#     print(a)
#2、请循环遍历出所有的value
    # print(b)
# 3、请在字典中增加一个键值对,"k4":"v4"
# dict.update({'k4':'v4'})
# print(dict)
'''————————————————————————————————————————————————————————————————————————————————————————'''

# 小明去超市购买水果，账单如下
# 苹果  32.8
# 香蕉  22
# 葡萄  15.5
# 请将上面的数据存储到字典里，可以根据水果名称查询购买这个水果的费用
# 用水果名称做key，金额做value，创建一个字典

# zd={'苹果':32.8,'香蕉':22,'葡萄':15.5}
# while True:
#     a=input('输入名称')
#     if a=='q' or a=='Q':
#         print('成功退出')
#         break
#     else:
#         print(zd[a])


# 小明，小刚去超市里购买水果
# 小明购买了苹果，草莓，香蕉，小刚购买了葡萄，橘子，樱桃，请从下面的描述的字典中，计算每个人花费的金额，并写入到money字段里。
# 以姓名做key，value仍然是字典
# Friuts ={'苹果':12.3,
#         '草莓':12.3,
#         '香蕉':12.3,
#         '葡萄':12.3,
#         '橘子':12.3,
#         '樱桃':12.3
# }
# xm={'苹果':12.3,'草莓':12.3,'香蕉':12.3}
# c=0
# for a,b in xm.items():
#     c=c+b
# print('总金额为%.2f'%(c))
# xg={ '葡萄':12.3,'橘子':12.3,'樱桃':12.3}
# d=0
# for e,f in xg.items():
#         d=d+f
# print('总金额为%.2f'%(d))

'''———————————————————————————————————————————————————————————————————————————————————————————————————————————————————'''

# 编写一个函数，传入一个列表，并统计每个数字出现的次数。返回字典数据：{21:3,56:9,10:3}
# from collections import Counter
# l1=[1,2,3,5,1,5,1,5,2,6,8,8,6,3,41,1,5,2,1,2,5,6,3,4,]
# print(Counter(l1))


# 有以下公司员工信息，将数据转换为字典方式（姓名作为键，其他作为值,张三:{xxx:xxx,xx:xxx}）
# # 姓名  年龄  性别  编号   任职公司   薪资   部门编号
# names = [
#     ["刘备","56","男","106","IBM", 500 ,"50"],
#     ["大乔","19","女","230","微软", 501 ,"60"],
#     ["小乔", "19", "女", "210", "Oracle", 600, "60"],
#     ["张飞", "45", "男", "230", "Tencent", 700 , "10"]

# mes={'刘备':{'年龄':'56','性别':'男','编号':'106','任职公司':'IBM','薪资':'500','部门编号':'50'},
#         '大乔':{'年龄':'19','性别':'女','编号':'230','任职公司':'微软','薪资':'501','部门编号':'60'},
#         '小乔':{'年龄':'19','性别':'女','编号':'210','任职公司':'Oracle','薪资':'600','部门编号':'60'},
#         '张飞': {'年龄': '45', '性别': '男', '编号': '230', '任职公司': 'Tencent', '薪资': '700', '部门编号': '10'},
#      }


