

list = [10,60,43,63,63,120,72,69,35,140,90,24,45,25,60,129,10,43,63,60,63,60,58,140,48,43,57,10,63,78]
#羽绒服
list2 =[10,69,140,10,10]
#牛仔裤
list3 =[60,72,35,90,60,60,140]
#风衣
list4 =[43,25,43,60,43,78]
#皮草
list5 =[63,24,63,57]
#T血
list6 =[63,45,129,63,58,48,63]
#衬衫
list7 =[120]
a = sum(list)
b = int (a/30)
c = sum(list2)*253.6+sum(list3)*86.3+sum(list4)*96.8+sum(list5)*135.9+sum(list6)*65.8+sum(list7)*49.3
print('总销售额为：', c)
print('平均每日销售量为：' , b)
print('羽绒服月销占比为：%.2f' % (sum(list2)/a*100),'%')
print('牛仔裤月销占比为：%.2f' %(sum(list3)/a*100),'%')
print('风衣月销占比为：%.2f' %(sum(list4)/a*100),'%')
print('皮草月销占比为：%.2f' %(sum(list5)/a*100),'%')
print('T恤月销占比为：%.2f' %(sum(list6)/a*100),'%')
print('衬衫月销占比为：%.2f' %(sum(list7)/a*100),'%')